devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
/*=========================================================================*//**
@file    uart.c

@author  Daniel Zorychta

@brief   This file support USART peripherals

@note    Copyright (C) 2012 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "system/dnxmodule.h"
#include "system/thread.h"
#include "stm32f1/uart_cfg.h"
#include "stm32f1/uart_def.h"
#include "stm32f1/stm32f10x.h"
#include "stm32f1/lib/stm32f10x_rcc.h"
#include <unistd.h>

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define RELEASE_TIMEOUT                         100
#define TX_WAIT_TIMEOUT                         MAX_DELAY
#define RX_WAIT_TIMEOUT                         MAX_DELAY
#define MTX_BLOCK_TIMEOUT                       MAX_DELAY


/** translation of configuration bits to function-like macros */
#define wakeup_USART_on_address_mark(usart)     usart->CR1 |=  USART_CR1_WAKE
#define wakeup_USART_on_idle_line(usart)        usart->CR1 &= ~USART_CR1_WAKE
#define enable_parity_check(usart)              usart->CR1 |=  USART_CR1_PCE
#define disable_parity_check(usart)             usart->CR1 &= ~USART_CR1_PCE
#define enable_odd_parity(usart)                usart->CR1 |=  USART_CR1_PS
#define enable_even_parity(usart)               usart->CR1 &= ~USART_CR1_PS
#define enable_transmitter(usart)               usart->CR1 |=  USART_CR1_TE
#define disable_transmitter(usart)              usart->CR1 &= ~USART_CR1_TE
#define enable_receiver(usart)                  usart->CR1 |=  USART_CR1_RE
#define disable_receiver(usart)                 usart->CR1 &= ~USART_CR1_RE
#define receiver_wakeup_in_mute_mode(usart)     usart->CR1 |=  USART_CR1_RWU
#define receiver_wakeup_in_active_mode(usart)   usart->CR1 &= ~USART_CR1_RWU
#define enable_LIN_mode(usart)                  usart->CR2 |=  USART_CR2_LINEN
#define disable_LIN_mode(usart)                 usart->CR2 &= ~USART_CR2_LINEN
#define set_1_stop_bit(usart)                   usart->CR2 &= ~USART_CR2_STOP
#define set_2_stop_bits(usart)                  while (0) {usart->CR2 &= ~USART_CR2_STOP; usart->CR2 |= USART_CR2_STOP_1;}
#define detect_10_bit_LIN_break(usart)          usart->CR2 &= ~USART_CR2_LBDL
#define detect_11_bit_LIN_break(usart)          usart->CR2 |=  USART_CR2_LBDL
#define set_address_node(usart, adr)            while (0) {usart->CR2 &= ~USART_CR2_ADD; usart->CR2 |= (adr & USART_CR2_ADD);}
#define set_baud_rate(usart, clk, baud)         usart->BRR = (u16_t)(((u32_t)clk / (u32_t)baud) + 1)
#define enable_CTS(usart)                       usart->CR3 |=  USART_CR3_CTSE
#define disable_CTS(usart)                      usart->CR3 &= ~USART_CR3_CTSE
#define enable_RTS(usart)                       usart->CR3 |=  USART_CR3_RTSE
#define disable_RTS(usart)                      usart->CR3 &= ~USART_CR3_RTSE
#define enable_USART(usart)                     usart->CR1 |=  USART_CR1_UE
#define disable_USART(usart)                    usart->CR1 &= ~UART_CR1_UE1
#define enable_RXNE_IRQ(usart)                  usart->CR1 |=  USART_CR1_RXNEIE
#define disable_RXNE_IRQ(usart)                 usart->CR1 &= ~UART_CR1_RXNEIE
#define enable_TXE_IRQ(usart)                   usart->CR1 |=  USART_CR1_TXEIE
#define disable_TXE_IRQ(usart)                  usart->CR1 &= ~USART_CR1_TXEIE

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* irq configuration */
struct irq_cfg {
        IRQn_Type irqn;
        u32_t     priority;
};

/* USART handling structure */
struct UART_data {
        struct Rx_FIFO {
                u8_t            buffer[_UART_RX_BUFFER_SIZE];
                u16_t           buffer_level;
                u16_t           read_index;
                u16_t           write_index;
        } Rx_FIFO;

        struct Tx_buffer {
                const u8_t     *src_ptr;
                size_t          data_size;
        } Tx_buffer;

        sem_t                  *data_write_sem;
        sem_t                  *data_read_sem;
        mutex_t                *port_lock_rx_mtx;
        mutex_t                *port_lock_tx_mtx;
        u8_t                    major;
        struct UART_config      config;
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t uart_turn_on            (USART_t *uart);
static stdret_t uart_turn_off           (USART_t *uart);
static void     configure_uart          (u8_t major, struct UART_config *config);
static bool     fifo_write              (struct Rx_FIFO *fifo, u8_t *data);
static bool     fifo_read               (struct Rx_FIFO *fifo, u8_t *data);
static void     handle_irq              (u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
/* addresses of UART devices */
static USART_t *const uart[_UART_NUMBER] = {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        USART1,
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        USART2,
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        USART3,
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        UART4,
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        UART5,
        #endif
};

