devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
/* irq configuration */
static const struct irq_cfg irq[_UART_NUMBER] = {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        {.irqn = USART1_IRQn, .priority = _UART1_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        {.irqn = USART2_IRQn, .priority = _UART2_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        {.irqn = USART3_IRQn, .priority = _UART3_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        {.irqn = UART4_IRQn, .priority = _UART4_IRQ_PRIORITY},
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        {.irqn = UART5_IRQn, .priority = _UART5_IRQ_PRIORITY}
        #endif
};

/* uart default configuration */
static const struct UART_config uart_default_config = {
        .parity             = _UART_DEFAULT_PARITY,
        .stop_bits          = _UART_DEFAULT_STOP_BITS,
        .LIN_break_length   = _UART_DEFAULT_LIN_BREAK_LEN,
        .tx_enable          = _UART_DEFAULT_TX_ENABLE,
        .rx_enable          = _UART_DEFAULT_RX_ENABLE,
        .lin_mode_enable    = _UART_DEFAULT_LIN_MODE_ENABLE,
        .hardware_flow_ctrl = _UART_DEFAULT_HW_FLOW_CTRL,
        .baud               = _UART_DEFAULT_BAUD
};

/* structure which identify USARTs data in the IRQs */
static struct UART_data *uart_data[_UART_NUMBER];

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(UART, void **device_handle, u8_t major, u8_t minor)
{
        UNUSED_ARG(minor);

        STOP_IF(device_handle == NULL);

        if (major >= _UART_NUMBER || minor != _UART_MINOR_NUMBER) {
                errno = EINVAL;
                return STD_RET_ERROR;
        }

        uart_data[major] = calloc(1, sizeof(struct UART_data));
        if (uart_data[major]) {

                uart_data[major]->data_write_sem   = semaphore_new(1, 1);
                uart_data[major]->data_read_sem    = semaphore_new(_UART_RX_BUFFER_SIZE, 0);
                uart_data[major]->port_lock_rx_mtx = mutex_new(MUTEX_NORMAL);
                uart_data[major]->port_lock_tx_mtx = mutex_new(MUTEX_NORMAL);

                if (  uart_data[major]->data_write_sem
                   && uart_data[major]->data_read_sem
                   && uart_data[major]->port_lock_rx_mtx
                   && uart_data[major]->port_lock_tx_mtx) {

                        uart_data[major]->major = major;

                        uart_turn_on(uart[major]);
                        configure_uart(major, (struct UART_config *)&uart_default_config);

                        *device_handle = uart_data[major];

                        return STD_RET_OK;
                } else {
                        if (uart_data[major]->data_write_sem) {
                                semaphore_delete(uart_data[major]->data_write_sem);
                        }

                        if (uart_data[major]->data_read_sem) {
                                semaphore_delete(uart_data[major]->data_read_sem);
                        }

                        if (uart_data[major]->port_lock_rx_mtx) {
                                mutex_delete(uart_data[major]->port_lock_rx_mtx);
                        }

                        if (uart_data[major]->port_lock_tx_mtx) {
                                mutex_delete(uart_data[major]->port_lock_tx_mtx);
                        }

                        free(uart_data[major]);
                        uart_data[major] = NULL;
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        struct UART_data *hdl = device_handle;

        if (mutex_lock(hdl->port_lock_rx_mtx, RELEASE_TIMEOUT)) {
                if (mutex_lock(hdl->port_lock_tx_mtx, RELEASE_TIMEOUT)) {

                        critical_section_begin();

                        mutex_unlock(hdl->port_lock_rx_mtx);
                        mutex_unlock(hdl->port_lock_tx_mtx);

                        mutex_delete(hdl->port_lock_rx_mtx);
                        mutex_delete(hdl->port_lock_tx_mtx);

                        semaphore_delete(hdl->data_write_sem);
                        uart_turn_off(uart[hdl->major]);

                        uart_data[hdl->major] = NULL;
                        free(hdl);

                        critical_section_end();

                        return STD_RET_OK;
                }

                mutex_unlock(hdl->port_lock_rx_mtx);
        }

        errno = EBUSY;
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(UART, void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

