devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 * @param[in ]          *opened_by_task         task with opened this device (valid only if force is true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(UART, void *device_handle, bool force, const task_t *opened_by_task)
{
        UNUSED_ARG(force);
        UNUSED_ARG(opened_by_task);

        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(UART, void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);

        struct UART_data *hdl = device_handle;

        ssize_t n = 0;
        if (mutex_lock(hdl->port_lock_tx_mtx, MTX_BLOCK_TIMEOUT)) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = count;

                SET_BIT(uart[hdl->major]->CR1, USART_CR1_TXEIE);
                semaphore_wait(hdl->data_write_sem, TX_WAIT_TIMEOUT);

                n = count - hdl->Tx_buffer.data_size;

                mutex_unlock(hdl->port_lock_tx_mtx);
        } else {
                errno = EBUSY;
                n     = -1;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(UART, void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        UNUSED_ARG(fpos);

        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);

        struct UART_data *hdl = device_handle;

        ssize_t n = 0;
        if (mutex_lock(hdl->port_lock_rx_mtx, MTX_BLOCK_TIMEOUT)) {
                while (count--) {
                        if (semaphore_wait(hdl->data_read_sem, RX_WAIT_TIMEOUT)) {
                                critical_section_begin();
                                if (fifo_read(&hdl->Rx_FIFO, dst)) {
                                        n++;
                                }
                                critical_section_end();
                        }
                }

                mutex_unlock(hdl->port_lock_rx_mtx);
        } else {
                errno = EBUSY;
                n     = -1;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(UART, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

        struct UART_data *hdl    = device_handle;
        stdret_t          status = STD_RET_OK;

        if (arg) {
                switch (request) {
                case UART_IORQ_SET_CONFIGURATION:
                        configure_uart(hdl->major, arg);
                        hdl->config = *(struct UART_config *)arg;
                        break;

                case UART_IORQ_GET_CONFIGURATION:
                        *(struct UART_config *)arg = hdl->config;
                        break;

                case UART_IORQ_GET_CHAR_UNBLOCKING:
                        if (!fifo_read(&hdl->Rx_FIFO, arg)) {
                             errno  = EAGAIN;
                             status = STD_RET_ERROR;
                        }
                        break;

                default:
                        errno  = EBADRQC;
                        status = STD_RET_ERROR;
                        break;
                }
        } else {
                errno  = EINVAL;
                status = STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(UART, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(UART, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

