devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t uart_turn_on(USART_t *USART)
{
        switch ((u32_t)USART) {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        case USART1_BASE:
                SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        case USART2_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        case USART3_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USART3EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        case UART4_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        case UART5_BASE:
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);
                break;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t uart_turn_off(USART_t *USART)
{
        switch ((u32_t)USART) {
        #if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
        case USART1_BASE:
                NVIC_DisableIRQ(USART1_IRQn);
                SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST);
                CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
        case USART2_BASE:
                NVIC_DisableIRQ(USART2_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART2RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_USART2EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
        case USART3_BASE:
                NVIC_DisableIRQ(USART3_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USART3RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_USART3EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART4EN)  && (_UART4_ENABLE > 0)
        case UART4_BASE:
                NVIC_DisableIRQ(UART4_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART4RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);
                break;
        #endif
        #if defined(RCC_APB1ENR_UART5EN)  && (_UART5_ENABLE > 0)
        case UART5_BASE:
                NVIC_DisableIRQ(UART5_IRQn);
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_UART5RST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);
                break;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function configure selected UART
 *
 * @param major         major device number
 * @param config        configuration structure
 */
//==============================================================================
static void configure_uart(u8_t major, struct UART_config *config)
{
        /* TODO */
}

//==============================================================================
/**
 * @brief Function write data to FIFO
 *
 * @param fifo          fifo buffer
 * @param data          data to write
 *
 * @return true if success, false on error
 */
//==============================================================================
static bool fifo_write(struct Rx_FIFO *fifo, u8_t *data)
{
        if (fifo->buffer_level < _UART_RX_BUFFER_SIZE) {
                fifo->buffer[fifo->write_index++] = *data;

                if (fifo->write_index >= _UART_RX_BUFFER_SIZE) {
                        fifo->write_index = 0;
                }

                fifo->buffer_level++;

                return true;
        } else {
                return false;
        }
}

//==============================================================================
/**
 * @brief Function read data from FIFO
 *
 * @param fifo          fifo buffer
 * @param data          data result
 *
 * @return true if success, false on error
 */
//==============================================================================
static bool fifo_read(struct Rx_FIFO *fifo, u8_t *data)
{
        if (fifo->buffer_level > 0) {
                *data = fifo->buffer[fifo->read_index++];

                if (fifo->read_index >= _UART_RX_BUFFER_SIZE) {
                        fifo->read_index = 0;
                }

                fifo->buffer_level--;

