devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
                return true;
        } else {
                return false;
        }
}

//==============================================================================
/**
 * @brief Interrupt handling
 *
 * @param major         major device number
 */
//==============================================================================
static void handle_irq(u8_t major)
{
        USART_t *UART = uart[major];

        /* transmitter interrupt handler */
        if (UART->SR & USART_SR_TXE) {
                if (uart_data[major]->Tx_buffer.data_size && uart_data[major]->Tx_buffer.src_ptr) {
                        UART->DR = *(uart_data[major]->Tx_buffer.src_ptr++);

                        if (--uart_data[major]->Tx_buffer.data_size == 0) {
                                uart_data[major]->Tx_buffer.src_ptr = NULL;

                                CLEAR_BIT(UART->CR1, USART_CR1_TXEIE);
                                semaphore_signal_from_ISR(uart_data[major]->data_write_sem, NULL);
                        }
                } else {
                        CLEAR_BIT(UART->CR1, USART_CR1_TXEIE);
                        semaphore_signal_from_ISR(uart_data[major]->data_write_sem, NULL);
                }
        }

        /* receiver interrupt handler */
        if (UART->SR & USART_SR_RXNE) {
                u8_t DR = UART->DR;

                if (fifo_write(&uart_data[major]->Rx_FIFO, &DR)) {
                        semaphore_signal_from_ISR(uart_data[major]->data_read_sem, NULL);
                }
        }
}

//==============================================================================
/**
 * @brief USART1 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_USART1EN) && (_UART1_ENABLE > 0)
void USART1_IRQHandler(void)
{
        handle_irq(_UART1);
}
#endif

//==============================================================================
/**
 * @brief USART2 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART2EN) && (_UART2_ENABLE > 0)
void USART2_IRQHandler(void)
{
        handle_irq(_UART2);
}
#endif

//==============================================================================
/**
 * @brief USART3 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART3EN) && (_UART3_ENABLE > 0)
void USART3_IRQHandler(void)
{
        handle_irq(_UART3);
}
#endif

//==============================================================================
/**
 * @brief UART4 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART4EN) && (_UART4_ENABLE > 0)
void UART4_IRQHandler(void)
{
        handle_irq(_UART4);
}
#endif

//==============================================================================
/**
 * @brief UART5 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART5EN) && (_UART5_ENABLE > 0)
void UART5_IRQHandler(void)
{
        handle_irq(_UART5);
}
#endif

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
